- https://www.kaggle.com/kralmachine/data-analysis-visualization-for-beginners

# 데이터 불러오기

In [6]:
import pandas as pd
data = pd.read_csv('Loan_payments_data.csv')

- Loan_id :A unique loan number assigned to each loan customers
- Loan_status: Whether a loan is paid off, in collection, new customer yet to payoff, or paid off after the collection efforts
- Principal: Basic principal loan amount at the origination #대출원금
- terms: Can be weekly (7 days), biweekly, and monthly payoff schedule
- Effective_date : When the loan got originated and took effects # 대출 시작 및 효력날짜?
- Due_date: Since it’s one-time payoff schedule, each loan has one single due date #상환만기날짜
- Paidoff_time: The actual time a customer pays off the loan#갚은날짜
- Pastdue_days: How many days a loan has been past due #오버된 날짜 
- Age,education,gender: customer’s basic demographic information

#Loan Collection : 대출회수

In [5]:
data

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [7]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
from plotly.offline import init_notebook_mode,iplot
init_notebook_mode(connected=True)
import plotly.graph_objs as go
import warnings
warnings.filterwarnings('ignore')

# EDA

## 데이터확인

In [8]:
data.head()

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female

In [9]:
data.tail()

,Loan_ID,loan_status,Principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,Gender
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [20]:
# data info
data.info()

data_info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Loan_ID         500 non-null    object
 1   loan_status     500 non-null    object
 2   Principal       500 non-null    int64
 3   terms           500 non-null    int64
 4   effective_date  500 non-null    object
 5   due_date        500 non-null    object
 6   paid_off_time   400 non-null    object
 7   past_due_days   200 non-null    float64
 8   age             500 non-null    int64
 9   education       500 non-null    object
 10  Gender          500 non-null    object
dtypes: float64(1), int64(3), object(7)
memory usage: 43.1+ KB

In [11]:
# data describe
data.describe()

         Principal       terms  past_due_days         age
count   500.000000  500.000000      200.00000  500.000000
mean    943.200000   22.824000       36.01000   31.116000
std     115.240274    8.000064       29.38088    6.084784
min     300.000000    7.000000        1.00000   18.000000
25%    1000.000000   15.000000        3.00000   27.000000
50%    1000.000000   30.000000       37.00000   30.000000
75%    1000.000000   30.000000       60.00000   35.000000
max    1000.000000   30.000000       76.00000   51.000000

In [13]:
#data age describe
data.age.describe()

count    500.000000
mean      31.116000
std        6.084784
min       18.000000
25%       27.000000
50%       30.000000
75%       35.000000
max       51.000000
Name: age, dtype: float64

In [23]:
# age and terms describe

print(data[['age','terms']].describe())

              age       terms
count  500.000000  500.000000
mean    31.116000   22.824000
std      6.084784    8.000064
min     18.000000    7.000000
25%     27.000000   15.000000
50%     30.000000   30.000000
75%     35.000000   30.000000
max     51.000000   30.000000

In [25]:
#data shape
data.shape

(500, 11)

### 상관계수

In [26]:
# data corr  # int값만 가능 
data.corr()

               Principal     terms  past_due_days       age
Principal       1.000000  0.534302      -0.093139 -0.092613
terms           0.534302  1.000000      -0.102613 -0.074259
past_due_days  -0.093139 -0.102613       1.000000 -0.053849
age            -0.092613 -0.074259      -0.053849  1.000000

In [27]:
# age terms  corr

data[['age','terms']].corr()

            age     terms
age    1.000000 -0.074259
terms -0.074259  1.000000

In [28]:
# data dtypes

data.dtypes

Loan_ID            object
loan_status        object
Principal           int64
terms               int64
effective_date     object
due_date           object
paid_off_time      object
past_due_days     float64
age                 int64
education          object
Gender             object
dtype: object

In [29]:
# data size
# row x column
data.size

5500

In [30]:
data.isnull().sum()

Loan_ID             0
loan_status         0
Principal           0
terms               0
effective_date      0
due_date            0
paid_off_time     100
past_due_days     300
age                 0
education           0
Gender              0
dtype: int64

In [31]:
# data columns

for col in data.columns:
    print(col)

Loan_ID
loan_status
Principal
terms
effective_date
due_date
paid_off_time
past_due_days
age
education
Gender

In [7]:
# rename

data = data.rename(columns={'Loan_ID':'loan_id',
                           'Principal':'principal',
                           'Gender':'gender'})

for col in data.columns:
    print(col)

loan_id
loan_status
principal
terms
effective_date
due_date
paid_off_time
past_due_days
age
education
gender

### column별 상태확인

In [37]:
# loan status

data['loan_status'].value_counts(dropna=False)

#paid off 갚은애들
#collection_paid off 지났지만 갚은애들
#collection 아직 안갚은애들  => PAID_off_TIME 이 NAN 값

PAIDOFF               300
COLLECTION_PAIDOFF    100
COLLECTION            100
Name: loan_status, dtype: int64

In [41]:
data[data['loan_status'] =='COLLECTION_PAIDOFF']

,load_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
400,xqd20160401,COLLECTION_PAIDOFF,1000,30,9/9/2016,10/8/2016,10/10/2016 11:45,2.0,26,college,male
401,xqd20160402,COLLECTION_PAIDOFF,1000,15,9/9/2016,9/23/2016,9/27/2016 17:00,4.0,28,college,male
402,xqd20320403,COLLECTION_PAIDOFF,1000,30,9/9/2016,11/7/2016,11/20/2016 14:10,13.0,39,college,male
403,xqd20160404,COLLECTION_PAIDOFF,1000,15,9/9/2016,9/23/2016,9/28/2016 15:38,5.0,29,Bechalor,male
404,xqd20190405,COLLECTION_PAIDOFF,800,15,9/9/2016,9/23/2016,9/26/2016 17:22,3.0,33,High School or Below,male
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [43]:
data[data['loan_status'] =='COLLECTION']

,load_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
300,xqd20160301,COLLECTION,1000,15,9/9/2016,9/23/2016,NaN,76.0,29,college,male
301,xqd20160302,COLLECTION,1000,30,9/9/2016,10/8/2016,NaN,61.0,37,High School or Below,male
302,xqd20160303,COLLECTION,1000,30,9/9/2016,10/8/2016,NaN,61.0,33,High School or Below,male
303,xqd20160304,COLLECTION,800,15,9/9/2016,9/23/2016,NaN,76.0,27,college,male
304,xqd20160305,COLLECTION,800,15,9/9/2016,9/23/2016,NaN,76.0,24,Bechalor,male
...,...,...,...,...,...,...,...,...,...,...,...
395,xqd20160396,COLLECTION,1000,30,9/11/2016,10/10/2016,NaN,59.0,25,High School or Below,male
396,xqd20160397,COLLECTION,1000,30,9/12/2016,10/11/2016,NaN,58.0,33,High School or Below,male
397,xqd20160398,COLLECTION,800,15,9/12/2016,9/26/2016,NaN,73.0,39,college,male
398,xqd20160399,COLLECTION,1000,30,9/12/2016,11/10/2016,NaN,28.0,28,college,male
399,xqd20160400,COLLECTION,1000,30,9/12/2016,10/11/2016,NaN,58.0,26,college,male

In [11]:
#loan status unique value

print(data.loan_status.unique())

loan_status_unique = data.loan_status.unique().reshape(-1,1)
print(loan_status_unique)

['PAIDOFF' 'COLLECTION' 'COLLECTION_PAIDOFF']
[['PAIDOFF']
 ['COLLECTION']
 ['COLLECTION_PAIDOFF']]

In [33]:
# loan status with loan_id counts

paidoff_count =0
collection_count =0
collection_paidoff_count=0

# loan status가 paid off 인 것의 길이
paidoff_count = len(data[data.loan_status == loan_status_unique[0][0]].loan_id)

#loan status가 collection 인 것의 길이
collection_count = len(data[data.loan_status == loan_status_unique[1][0]].loan_id)

#laon status 가 collection_paidoff 인것의 길이
collection_paidoff_count = len(data[data.loan_status == loan_status_unique[2][0]].loan_id)

In [34]:
print(paidoff_count)
print(collection_count)
print(collection_paidoff_count)

300
100
100

In [35]:
# 대출 금액별 카운트

print(data.principal.value_counts())

1000    377
800     111
300       6
500       3
900       2
700       1
Name: principal, dtype: int64

### groupby

In [37]:
#금액별 loan status

print(data.principal.isnull().sum())

print(data.groupby('loan_status')['principal'].value_counts())

0
loan_status         principal
COLLECTION          1000          77
                    800           23
COLLECTION_PAIDOFF  1000          80
                    800           19
                    500            1
PAIDOFF             1000         220
                    800           69
                    300            6
                    500            2
                    900            2
                    700            1
Name: principal, dtype: int64

In [39]:
# loan status별 금액 합계

print(data.groupby('loan_status')['principal'].sum())

loan_status
COLLECTION             95400
COLLECTION_PAIDOFF     95700
PAIDOFF               280500
Name: principal, dtype: int64

In [40]:
#terms

print(data.terms.isnull().sum())
print(data.terms.value_counts())

0
30    272
15    207
7      21
Name: terms, dtype: int64

In [44]:
# terms 에 따른 금액

print(data.groupby('terms')['principal'].value_counts())
print(data.groupby('terms')['principal'].sum())

terms  principal
7      1000          11
       300            6
       800            2
       500            1
       900            1
15     800          103
       1000         100
       500            2
       700            1
       900            1
30     1000         266
       800            6
Name: principal, dtype: int64
terms
7      15800
15    185000
30    270800
Name: principal, dtype: int64

### effective state

In [45]:
data

,loan_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [48]:
### effective state

print(data.effective_date.isnull().sum())

print(data['effective_date'].value_counts())

0
9/11/2016    231
9/12/2016    148
9/10/2016     46
9/14/2016     33
9/13/2016     23
9/9/2016      15
9/8/2016       4
Name: effective_date, dtype: int64

In [53]:
# 대출일 별 기간 및 금액 

#카운트
print(data.groupby('effective_date')[['terms','principal']].count())
#합계
print(data.groupby('effective_date')[['terms','principal']].sum())
#평균
print(data.groupby('effective_date')[['terms','principal']].mean())

                terms  principal
effective_date
9/10/2016          46         46
9/11/2016         231        231
9/12/2016         148        148
9/13/2016          23         23
9/14/2016          33         33
9/8/2016            4          4
9/9/2016           15         15
                terms  principal
effective_date
9/10/2016        1026      43200
9/11/2016        5328     219000
9/12/2016        3335     139400
9/13/2016         441      20900
9/14/2016         840      31400
9/8/2016          105       4000
9/9/2016          337      13700
                    terms    principal
effective_date
9/10/2016       22.304348   939.130435
9/11/2016       23.064935   948.051948
9/12/2016       22.533784   941.891892
9/13/2016       19.173913   908.695652
9/14/2016       25.454545   951.515152
9/8/2016        26.250000  1000.000000
9/9/2016        22.466667   913.333333

### age

In [64]:
print(data.age.isnull().sum())
print(data.groupby("age")[['terms','principal']].sum())

0
     terms  principal
age
18      30       1000
19      60       2000
20     105       4000
21     195       6800
22     172       7300
23     202       8000
24     525      22200
25     404      19400
26    1079      44100
27     899      36600
28     780      30500
29     898      39000
30     900      36200
31     494      21200
32     457      19400
33     735      27700
34     554      24200
35     546      23000
36     330      13200
37     442      17400
38     450      18000
39     195       9000
40     195       7600
41     105       4600
42      90       3600
43     105       4400
44      90       3600
45     120       5000
46      90       4200
47      45       2800
49      30       1000
50      75       3800
51      15        800

In [68]:
data_age = data.age.value_counts().index
data_age
len(data_age)

data_age_list=[]
for age in data_age:
    data_age_list.append(sum(data[data.age == int(age)].principal))

In [69]:
data_age_list

[44100,
 39000,
 36600,
 36200,
 30500,
 27700,
 23000,
 24200,
 22200,
 21200,
 19400,
 19400,
 18000,
 17400,
 13200,
 9000,
 8000,
 7600,
 7300,
 6800,
 5000,
 4200,
 4600,
 4400,
 3600,
 3800,
 4000,
 3600,
 2800,
 2000,
 800,
 1000,
 1000]

### education

In [81]:

data

,loan_id,loan_status,principal,terms,effective_date,due_date,paid_off_time,past_due_days,age,education,gender
0,xqd20166231,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/14/2016 19:31,NaN,45,High School or Below,male
1,xqd20168902,PAIDOFF,1000,30,9/8/2016,10/7/2016,10/7/2016 9:00,NaN,50,Bechalor,female
2,xqd20160003,PAIDOFF,1000,30,9/8/2016,10/7/2016,9/25/2016 16:58,NaN,33,Bechalor,female
3,xqd20160004,PAIDOFF,1000,15,9/8/2016,9/22/2016,9/22/2016 20:00,NaN,27,college,male
4,xqd20160005,PAIDOFF,1000,30,9/9/2016,10/8/2016,9/23/2016 21:36,NaN,28,college,female
...,...,...,...,...,...,...,...,...,...,...,...
495,xqd20160496,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/14/2016 19:08,3.0,28,High School or Below,male
496,xqd20160497,COLLECTION_PAIDOFF,1000,15,9/12/2016,9/26/2016,10/10/2016 20:02,14.0,26,High School or Below,male
497,xqd20160498,COLLECTION_PAIDOFF,800,15,9/12/2016,9/26/2016,9/29/2016 11:49,3.0,30,college,male
498,xqd20160499,COLLECTION_PAIDOFF,1000,30,9/12/2016,11/10/2016,11/11/2016 22:40,1.0,38,college,female
499,xqd20160500,COLLECTION_PAIDOFF,1000,30,9/12/2016,10/11/2016,10/19/2016 11:58,8.0,28,High School or Below,male

In [84]:
#education state
print(data.education.unique())
print(data.education.value_counts())
print(data.groupby('education')['gender'].value_counts())

['High School or Below' 'Bechalor' 'college' 'Master or Above']
college                 220
High School or Below    209
Bechalor                 67
Master or Above           4
Name: education, dtype: int64
education             gender
Bechalor              male       54
                      female     13
High School or Below  male      178
                      female     31
Master or Above       male        4
college               male      187
                      female     33
Name: gender, dtype: int64

In [87]:
print(data.groupby('education')['loan_status'].value_counts())
print(data.groupby(['education','gender'])['principal'].sum())

education             loan_status
Bechalor              PAIDOFF                41
                      COLLECTION_PAIDOFF     15
                      COLLECTION             11
High School or Below  PAIDOFF               123
                      COLLECTION             49
                      COLLECTION_PAIDOFF     37
Master or Above       PAIDOFF                 3
                      COLLECTION              1
college               PAIDOFF               133
                      COLLECTION_PAIDOFF     48
                      COLLECTION             39
Name: loan_status, dtype: int64
education             gender
Bechalor              female     12400
                      male       50900
High School or Below  female     29400
                      male      169400
Master or Above       male        2400
college               female     31000
                      male      176100
Name: principal, dtype: int64

### due_date